#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler" "api_autoscale" {
        id = "default/api"

        metadata {
            annotations      = {}
            generation       = 0
            labels           = {}
            name             = "api"
            namespace        = "default"
            resource_version = "1368565"
            self_link        = "/apis/autoscaling/v1/namespaces/default/horizontalpodautoscalers/api"
            uid              = "720a143f-6fd8-40a0-ac1b-fc3c407c3dd0"
        }

      ~ spec {
            max_replicas                      = 10
            min_replicas                      = 2
            target_cpu_utilization_percentage = 75

          ~ scale_target_ref {
              + api_version = "extensions/v1beta1"
                kind        = "Deployment"
                name        = "api"
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler" "language_service_autoscale" {
        id = "default/language-service"

        metadata {
            annotations      = {}
            generation       = 0
            labels           = {}
            name             = "language-service"
            namespace        = "default"
            resource_version = "1368569"
            self_link        = "/apis/autoscaling/v1/namespaces/default/horizontalpodautoscalers/language-service"
            uid              = "ceb3f669-08ad-4461-9a00-2ce9ed31740f"
        }

      ~ spec {
            max_replicas                      = 10
            min_replicas                      = 2
            target_cpu_utilization_percentage = 75

          ~ scale_target_ref {
              + api_version = "extensions/v1beta1"
                kind        = "Deployment"
                name        = "language-service"
            }
        }
    }

  # module.infrastructure.module.monitoring.helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "prometheus-operator"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.37.0"
      + wait                       = true
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
